Repository: zziri/cmux
Catalog: Resources/Localizable.xcstrings
Source language: en
Languages: ar, bs, da, de, es, fr, it, ja, ko, nb, pl, pt_br, ru, th, tr, uk, zh_hans, zh_hant

# cli.cloud.domains.malformedResponse
source: The cmux app returned a publication response this CLI could not read.
ar: أرجع تطبيق cmux استجابة منشور لم يتمكن واجهة خط الأوامر (CLI) من قراءتها.
de: Die cmux-App hat eine Veröffentlichungs-Antwort zurückgegeben, die diese CLI nicht lesen konnte.
es: La aplicación cmux devolvió una respuesta de publicación que esta CLI no pudo leer.
fr: L’application cmux a renvoyé une réponse de publication que cette CLI n’a pas pu lire.
ja: cmux アプリから、この CLI では読み取れない公開レスポンスが返されました。
ko: cmux 앱이 이 CLI에서 읽을 수 없는 게시(publication) 응답을 반환했습니다.
zh_hans: cmux 应用返回的发布响应，本 CLI 无法解析。
zh_hant: cmux 應用程式傳回了此 CLI 無法讀取的發佈回應。

# cli.cloud.domains.removed
source: Removed publication %@.
ar: تمت إزالة المنشور %@.
de: Veröffentlichung %@ entfernt.
es: Se eliminó la publicación %@.
fr: Publication %@ supprimée.
ja: 公開 %@ を削除しました。
ko: %@ 게시(publication)를 제거했습니다.
zh_hans: 已移除发布 %@。
zh_hant: 已移除發佈項目 %@。

# cli.cloud.domains.teamAccess
source: %1$@ (team %2$@)
ar: %1$@ (فريق %2$@)
es: %1$@ (equipo %2$@)
fr: %1$@ (équipe %2$@)
ja: %1$@（チーム %2$@）
ko: %1$@ (팀 %2$@)
zh_hans: %1$@（团队 %2$@）
zh_hant: %1$@ (團隊 %2$@)

# cli.cloud.domains.teamOnly
source: `--team` can only be used with team access.
ar: يمكن استخدام `--team` فقط مع وصول الفريق.
de: `--team` kann nur mit Team-Zugriff verwendet werden.
es: `--team` solo se puede usar con acceso de equipo.
fr: `--team` peut uniquement être utilisé avec l'accès team.
ja: `--team` は team アクセスでのみ使用できます。
ko: `--team`은 팀 액세스(team access)와 함께만 사용할 수 있습니다.
zh_hans: `--team` 只能与 team 访问级别一起使用。
zh_hant: `--team` 只能與團隊存取權限搭配使用。

# cli.cloud.domains.teamRequired
source: Team access requires `--team <id>`.
ar: يتطلب وصول الفريق استخدام `--team <id>`.
de: Team-Zugriff erfordert `--team <id>`.
es: El acceso de equipo requiere `--team <id>`.
fr: L'accès team requiert `--team <id>`.
ja: team アクセスには `--team <id>` が必要です。
ko: 팀 액세스를 사용하려면 `--team <id>`가 필요합니다.
zh_hans: team 访问级别需要 `--team <id>`。
zh_hant: 團隊存取權限需要 `--team <id>`。

# cli.cloud.domains.unknown
source: unknown
ar: مجهول
de: unbekannt
es: desconocido
fr: inconnu
ja: 不明
ko: 알려지지 않은
zh_hans: 未知
zh_hant: 未知

# cli.cloud.domains.usage
source: Usage: cmux cloud domains [list] cmux cloud domains zones cmux cloud domains verify <domain> cmux cloud domains publish <vm> <port> [--domain <hostname>] [--access personal|team|public] [--team <id>] [--org-slug <slug>] [--yes] cmux cloud domains access <hostname> <personal|team|public> [--team <id>] [--yes] cmux cloud domains grant <hostname> <email> [--expires <ISO-date>] cmux cloud domains ungrant <hostname> <email> cmux cloud domains grants <hostname> cmux cloud domains rm <hostname> Verify a domain you own first: `verify` prints the DNS records to add, then run it again to complete. `publish --domain` then accepts that domain or any one-label child. Generated names use <vm>--<organization>--<port>.cmux.sh and need no verification. Access defaults to the owning team or personal owner. Email grants apply to one port only. Public access requires confirmation; --yes confirms it for scripts. Add --json for JSON output.
ar: الاستخدام: cmux cloud domains [list] cmux cloud domains zones cmux cloud domains verify <domain> cmux cloud domains publish <vm> <port> [--domain <hostname>] [--access personal|team|public] [--team <id>] [--org-slug <slug>] [--yes] cmux cloud domains access <hostname> <personal|team|public> [--team <id>] [--yes] cmux cloud domains grant <hostname> <email> [--expires <ISO-date>] cmux cloud domains ungrant <hostname> <email> cmux cloud domains grants <hostname> cmux cloud domains rm <hostname> تحقق من النطاق الذي تملكه أولاً: يطبع `verify` سجلات DNS المراد إضافتها، ثم قم بتشغيله مرة أخرى للإكمال. يقبل `publish --domain` بعد ذلك هذا النطاق أو أي نطاق فرعي من مستوى واحد (one-label). تستخدم الأسماء التي تم إنشاؤها الصيغة <vm>--<organization>--<port>.cmux.sh ولا تحتاج إلى تحقق. يتم تعيين الوصول افتراضيًا للفريق المالك أو المالك الشخصي. تنطبق صلاحيات البريد الإلكتروني على منفذ واحد فقط. الوصول العام يتطلب تأكيدًا؛ ويؤكده الخيار --yes للبرمجيات النصية (scripts). أضف --json لإخراج بتنسيق JSON.
de: Verwendung: cmux cloud domains [list] cmux cloud domains zones cmux cloud domains verify <domain> cmux cloud domains publish <vm> <port> [--domain <hostname>] [--access personal|team|public] [--team <id>] [--org-slug <slug>] [--yes] cmux cloud domains access <hostname> <personal|team|public> [--team <id>] [--yes] cmux cloud domains grant <hostname> <email> [--expires <ISO-date>] cmux cloud domains ungrant <hostname> <email> cmux cloud domains grants <hostname> cmux cloud domains rm <hostname> Verifizieren Sie zuerst eine Domain, die Sie besitzen: `verify` gibt die hinzuzufügenden DNS-Einträge aus, führen Sie es dann erneut aus, um den Vorgang abzuschließen. `publish --domain` akzeptiert dann diese Domain oder jedes einteilige Subdomain-Label. Generierte Namen verwenden <vm>--<organization>--<port>.cmux.sh und erfordern keine Verifizierung. Der Zugriff ist standardmäßig auf das besitzende Team oder den persönlichen Eigentümer eingestellt. E-Mail-Freigaben gelten nur für einen Port. Öffentlicher Zugriff erfordert eine Bestätigung; --yes bestätigt dies für Skripte. Fügen Sie --json für die JSON-Ausgabe hinzu.
es: Uso: cmux cloud domains [list] cmux cloud domains zones cmux cloud domains verify <domain> cmux cloud domains publish <vm> <port> [--domain <hostname>] [--access personal|team|public] [--team <id>] [--org-slug <slug>] [--yes] cmux cloud domains access <hostname> <personal|team|public> [--team <id>] [--yes] cmux cloud domains grant <hostname> <email> [--expires <ISO-date>] cmux cloud domains ungrant <hostname> <email> cmux cloud domains grants <hostname> cmux cloud domains rm <hostname> Verifica primero un dominio de tu propiedad: `verify` muestra los registros DNS que debes añadir, luego ejecútalo de nuevo para completarlo. `publish --domain` aceptará entonces ese dominio o cualquier subdominio de un solo nivel. Los nombres generados usan <vm>--<organization>--<port>.cmux.sh y no necesitan verificación. El acceso predeterminado es para el equipo propietario o el propietario personal. Las concesiones por correo electrónico se aplican a un solo puerto. El acceso público requiere confirmación; --yes lo confirma para los scripts. Añade --json para obtener la salida en formato JSON.
fr: Utilisation : cmux cloud domains [list] cmux cloud domains zones cmux cloud domains verify <domain> cmux cloud domains publish <vm> <port> [--domain <hostname>] [--access personal|team|public] [--team <id>] [--org-slug <slug>] [--yes] cmux cloud domains access <hostname> <personal|team|public> [--team <id>] [--yes] cmux cloud domains grant <hostname> <email> [--expires <ISO-date>] cmux cloud domains ungrant <hostname> <email> cmux cloud domains grants <hostname> cmux cloud domains rm <hostname> Vérifiez d'abord un domaine que vous possédez : `verify` affiche les enregistrements DNS à ajouter, puis exécutez-le à nouveau pour terminer. `publish --domain` accepte ensuite ce domaine ou tout sous-domaine à un seul label. Les noms générés utilisent <vm>--<organization>--<port>.cmux.sh et ne nécessitent aucune vérification. L'accès est attribué par défaut à l'équipe propriétaire ou au propriétaire personnel. Les autorisations par e-mail s'appliquent à un seul port. L'accès public nécessite une confirmation ; --yes le confirme pour les scripts. Ajoutez --json pour une sortie au format JSON.
ja: 使用方法: cmux cloud domains [list] cmux cloud domains zones cmux cloud domains verify <domain> cmux cloud domains publish <vm> <port> [--domain <hostname>] [--access personal|team|public] [--team <id>] [--org-slug <slug>] [--yes] cmux cloud domains access <hostname> <personal|team|public> [--team <id>] [--yes] cmux cloud domains grant <hostname> <email> [--expires <ISO-date>] cmux cloud domains ungrant <hostname> <email> cmux cloud domains grants <hostname> cmux cloud domains rm <hostname> カスタムドメインは先にverifyを実行し、表示されたDNSレコードを追加した後、もう一度verifyを実行して所有権確認を完了してください。 publish --domainには確認済みドメイン、またはその直下1階層のサブドメインを指定できます。 生成される名前は<vm>--<organization>--<port>.cmux.shで、DNS確認は不要です。 既定のアクセス権は所有チームまたは個人所有者です。メールのアクセス許可は1つのポートにのみ適用されます。 公開アクセスには確認が必要です。スクリプトでは--yesで確認できます。JSON出力には--jsonを追加してください。
ko: 사용법: cmux cloud domains [list] cmux cloud domains zones cmux cloud domains verify <domain> cmux cloud domains publish <vm> <port> [--domain <hostname>] [--access personal|team|public] [--team <id>] [--org-slug <slug>] [--yes] cmux cloud domains access <hostname> <personal|team|public> [--team <id>] [--yes] cmux cloud domains grant <hostname> <email> [--expires <ISO-date>] cmux cloud domains ungrant <hostname> <email> cmux cloud domains grants <hostname> cmux cloud domains rm <hostname> 먼저 소유한 도메인을 확인하세요. `verify`는 추가할 DNS 레코드를 출력하며, 완료하려면 레코드를 추가한 뒤 다시 실행하십시오. 이후 `publish --domain`에서 해당 도메인 또는 임의의 단일 레이블 하위 도메인을 사용할 수 있습니다. 생성된 이름은 <vm>--<organization>--<port>.cmux.sh 형식을 사용하며 별도의 확인이 필요하지 않습니다. 액세스 기본값은 소유 팀 또는 개인 소유자입니다. 이메일 권한 부여(grants)는 단일 포트에만 적용됩니다. 퍼블릭 액세스는 확인이 필요하며, --yes는 스크립트 실행 시 이를 확인 처리합니다. JSON 출력을 보려면 --json을 추가하세요.
zh_hans: 用法: cmux cloud domains [list] cmux cloud domains zones cmux cloud domains verify <domain> cmux cloud domains publish <vm> <port> [--domain <hostname>] [--access personal|team|public] [--team <id>] [--org-slug <slug>] [--yes] cmux cloud domains access <hostname> <personal|team|public> [--team <id>] [--yes] cmux cloud domains grant <hostname> <email> [--expires <ISO-date>] cmux cloud domains ungrant <hostname> <email> cmux cloud domains grants <hostname> cmux cloud domains rm <hostname> 请先验证你拥有的域名：`verify` 会打印需要添加的 DNS 记录，添加后再次运行 即可完成验证。之后 `publish --domain` 可接受该域名或它的任意一级子域名。 生成的名称形如 <vm>--<organization>--<port>.cmux.sh，无需验证。 访问级别默认归属所属团队或个人所有者。邮箱授权仅对单个端口生效。 公开访问需要确认；脚本中可用 --yes 直接确认。加 --json 输出 JSON。
zh_hant: 用法： cmux cloud domains [list] cmux cloud domains zones cmux cloud domains verify <domain> cmux cloud domains publish <vm> <port> [--domain <hostname>] [--access personal|team|public] [--team <id>] [--org-slug <slug>] [--yes] cmux cloud domains access <hostname> <personal|team|public> [--team <id>] [--yes] cmux cloud domains grant <hostname> <email> [--expires <ISO-date>] cmux cloud domains ungrant <hostname> <email> cmux cloud domains grants <hostname> cmux cloud domains rm <hostname> 請先驗證您擁有的網域：`verify` 會列印出要新增的 DNS 紀錄，然後再次執行它 以完成驗證。接著 `publish --domain` 將接受該網域或任何單標籤子網域。 產生的名稱會使用 <vm>--<organization>--<port>.cmux.sh，且不需要驗證。 存取權限預設為擁有的團隊或個人擁有者。Email 授權僅適用於單一連接埠。 公開存取權限需要確認；--yes 可為指令碼進行確認。新增 --json 可輸出 JSON 格式。

# cli.cloud.domains.verification.generated
source: verification: not required (cmux domain)
ar: التحقق: غير مطلوب (نطاق cmux)
de: verifizierung: nicht erforderlich (cmux-Domain)
es: verificación: no requerida (dominio de cmux)
fr: vérification : non requise (domaine cmux)
ja: 検証: 不要（cmux ドメイン）
ko: verification: 필요 없음 (cmux 도메인)
zh_hans: 验证: 无需验证（cmux 域名）
zh_hant: 驗證：不需要 (cmux 網域)

# cli.cloud.domains.verificationState
source: verification: %@
ar: التحقق: %@
de: Verifizierung: %@
es: verificación: %@
fr: vérification : %@
ja: 検証: %@
ko: 검증: %@
zh_hans: 验证: %@
zh_hant: 驗證：%@

# cli.cloud.domains.verifyHint
source: After updating DNS: cmux cloud domains verify %@
ar: بعد تحديث DNS: cmux cloud domains verify %@
de: Nach dem DNS-Update: cmux cloud domains verify %@
es: Después de actualizar el DNS: cmux cloud domains verify %@
fr: Après avoir mis à jour le DNS : cmux cloud domains verify %@
ja: DNS の更新後: cmux cloud domains verify %@
ko: DNS 업데이트 후 실행: cmux cloud domains verify %@
zh_hans: 更新 DNS 后运行: cmux cloud domains verify %@
zh_hant: 更新 DNS 後：cmux cloud domains verify %@

# cli.coderouter.aliases
source: coderouter|cr [coderouter-args...] (aliases for the CodeRouter CLI; offers to install it when missing)
ar: coderouter|cr [coderouter-args...] (أسماء بديلة لـ CodeRouter CLI؛ يعرض تثبيته عندما يكون مفقودًا)
de: coderouter|cr [coderouter-args...] (Aliase für die CodeRouter-CLI; bietet an, diese zu installieren, wenn sie fehlt)
es: coderouter|cr [coderouter-args...] (alias para la CLI de CodeRouter; ofrece instalarla cuando falta)
fr: coderouter|cr [coderouter-args...] (alias pour la CLI CodeRouter ; propose de l'installer si elle est manquante)
ja: coderouter|cr [coderouter-args...] (CodeRouter CLI のエイリアス。未インストール時はインストールを提案)
ko: coderouter|cr [coderouter-args...] (CodeRouter CLI의 별칭, 없는 경우 설치 제안)
zh_hans: coderouter|cr [coderouter-args...] (CodeRouter CLI 的别名；如果缺失会提示安装)
zh_hant: coderouter|cr [coderouter-args...] (CodeRouter CLI 的別名；如果未安裝，會提示安裝)

# cli.coderouter.bootstrap.confirm
source: Install CodeRouter now? [y/N]
ar: هل تريد تثبيت CodeRouter الآن؟ [y/N]
de: CodeRouter jetzt installieren? [y/N]
es: ¿Instalar CodeRouter ahora? [s/N]
fr: Installer CodeRouter maintenant ? [o/N]
ja: 今すぐ CodeRouter をインストールしますか? [y/N]
ko: 지금 CodeRouter를 설치하시겠습니까? [y/N]
zh_hans: 现在安装 CodeRouter 吗？[y/N]
zh_hant: 現在要安裝 CodeRouter 嗎？[y/N]

# cli.coderouter.bootstrap.declined
source: CodeRouter was not installed. Install it later with: %@
ar: لم يتم تثبيت CodeRouter. قم بتثبيته لاحقًا باستخدام: %@
de: CodeRouter wurde nicht installiert. Installiere es später mit: %@
es: No se instaló CodeRouter. Instálalo más tarde con: %@
fr: CodeRouter n'a pas été installé. Installez-le plus tard avec : %@
ja: CodeRouter はインストールされませんでした。後で次のコマンドでインストールできます: %@
ko: CodeRouter가 설치되지 않았습니다. 나중에 다음 명령어로 설치하십시오: %@
zh_hans: 未安装 CodeRouter。稍后可通过以下命令安装： %@
zh_hant: 未安裝 CodeRouter。稍後可使用以下命令安裝： %@

# cli.coderouter.bootstrap.downloadFailed
source: Could not download the CodeRouter installer (curl exited with status %1$d). Retry, or install it with: %2$@
ar: تعذر تنزيل برنامج تثبيت CodeRouter (خرج curl بالحالة %1$d). أعد المحاولة، أو ثبته باستخدام: %2$@
de: Der CodeRouter-Installer konnte nicht heruntergeladen werden (curl wurde mit Status %1$d beendet). Versuche es erneut oder installiere es mit: %2$@
es: No se pudo descargar el instalador de CodeRouter (curl finalizó con el estado %1$d). Reinténtalo o instálalo con: %2$@
fr: Impossible de télécharger l'installateur de CodeRouter (curl a quitté avec le statut %1$d). Réessayez, ou installez-le avec : %2$@
ja: CodeRouter インストーラーをダウンロードできませんでした (curl の終了ステータス: %1$d)。もう一度お試しいただくか、次のコマンドでインストールしてください: %2$@
ko: CodeRouter 설치 프로그램을 다운로드할 수 없습니다 (curl이 상태 코드 %1$d(으)로 종료됨). 다시 시도하거나 다음 명령어로 설치하십시오: %2$@
zh_hans: 无法下载 CodeRouter 安装程序 (curl 以状态码 %1$d 退出)。请重试，或使用以下命令安装： %2$@
zh_hant: 無法下載 CodeRouter 安裝程式 (curl 結束，狀態碼為 %1$d)。請重試，或使用以下命令安裝： %2$@

# cli.coderouter.bootstrap.installedNotFound
source: The CodeRouter installer finished, but its command could not be found in %@. Check the installation and try again.
ar: اكتمل تثبيت CodeRouter، لكن لم يتم العثور على أمره في %@. تحقق من التثبيت وحاول مرة أخرى.
de: Die Installation von CodeRouter ist abgeschlossen, aber der Befehl wurde in %@ nicht gefunden. Prüfen Sie die Installation und versuchen Sie es erneut.
es: La instalación de CodeRouter finalizó, pero no se encontró su comando en %@. Comprueba la instalación y vuelve a intentarlo.
fr: L’installation de CodeRouter est terminée, mais sa commande est introuvable dans %@. Vérifiez l’installation et réessayez.
ja: CodeRouter のインストールは完了しましたが、%@ にコマンドが見つかりませんでした。インストールを確認して、もう一度お試しください。
ko: CodeRouter 설치가 완료되었지만 %@에서 명령을 찾을 수 없습니다. 설치 상태를 확인한 후 다시 시도하세요.
zh_hans: CodeRouter 安装已完成，但在 %@ 中找不到其命令。请检查安装结果后重试。
zh_hant: CodeRouter 安裝已完成，但在 %@ 中找不到其指令。請檢查安裝結果後重試。

# cli.coderouter.bootstrap.installerFailed
source: The CodeRouter installer exited with status %1$d. Retry, or install it with: %2$@
ar: خرج برنامج تثبيت CodeRouter بالحالة %1$d. أعد المحاولة، أو ثبته باستخدام: %2$@
de: Der CodeRouter-Installer wurde mit Status %1$d beendet. Versuche es erneut oder installiere es mit: %2$@
es: El instalador de CodeRouter finalizó con el estado %1$d. Reinténtalo o instálalo con: %2$@
fr: L'installateur de CodeRouter a quitté avec le statut %1$d. Réessayez, ou installez-le avec : %2$@
ja: CodeRouter インストーラーが終了ステータス %1$d で終了しました。もう一度お試しいただくか、次のコマンドでインストールしてください: %2$@
ko: CodeRouter 설치 프로그램이 상태 코드 %1$d(으)로 종료되었습니다. 다시 시도하거나 다음 명령어로 설치하십시오: %2$@
zh_hans: CodeRouter 安装程序以状态码 %1$d 退出。请重试，或使用以下命令安装： %2$@
zh_hant: CodeRouter 安裝程式結束，狀態碼為 %1$d。請重試，或使用以下命令安裝： %2$@

# cli.coderouter.bootstrap.installing
source: Installing CodeRouter...
ar: جاري تثبيت CodeRouter...
de: CodeRouter wird installiert...
es: Instalando CodeRouter...
fr: Installation de CodeRouter...
ja: CodeRouter をインストールしています...
ko: CodeRouter 설치 중...
zh_hans: 正在安装 CodeRouter...
zh_hant: 正在安裝 CodeRouter...

# cli.coderouter.bootstrap.notInstalled
source: CodeRouter CLI is not installed. Install it, then retry: %@
ar: CodeRouter CLI غير مثبت. قم بتثبيته، ثم أعد المحاولة: %@
de: CodeRouter-CLI ist nicht installiert. Installiere es und versuche es dann erneut: %@
es: La CLI de CodeRouter no está instalada. Instálala y vuelve a intentarlo: %@
fr: Le CLI CodeRouter n'est pas installé. Installez-le, puis réessayez : %@
ja: CodeRouter CLI がインストールされていません。次のコマンドでインストールしてから、もう一度お試しください: %@
ko: CodeRouter CLI가 설치되어 있지 않습니다. 설치한 뒤 다시 시도하십시오: %@
zh_hans: 未安装 CodeRouter CLI。请先安装，然后重试： %@
zh_hant: 未安裝 CodeRouter CLI。請先安裝，然後重試： %@

# cli.coderouter.bootstrap.offer
source: CodeRouter CLI is not installed. cmux can install it now by running the official installer: %1$@ This downloads the checksum-verified CodeRouter binary into %2$@ and adds that directory to your shell PATH.
ar: إن CodeRouter CLI غير مثبت. يمكن لـ cmux تثبيته الآن عن طريق تشغيل برنامج التثبيت الرسمي: %1$@ يؤدي هذا إلى تنزيل ثنائي CodeRouter الذي تم التحقق من المجموع الاختباري (checksum) الخاص به إلى %2$@ ويضيف هذا الدليل إلى متغير البيئة PATH الخاص بالصدفة.
de: Die CodeRouter-CLI ist nicht installiert. cmux kann sie jetzt installieren, indem der offizielle Installer ausgeführt wird: %1$@ Dadurch wird die per Prüfsumme verifizierte CodeRouter-Binärdatei nach %2$@ heruntergeladen und dieses Verzeichnis zu deinem Shell-PATH hinzugefügt.
es: La CLI de CodeRouter no está instalada. cmux puede instalarla ahora ejecutando el instalador oficial: %1$@ Esto descarga el binario de CodeRouter verificado por suma de comprobación en %2$@ y añade ese directorio al PATH de tu shell.
fr: Le CLI CodeRouter n'est pas installé. cmux peut l'installer maintenant en exécutant l'installateur officiel : %1$@ Cela télécharge le binaire CodeRouter vérifié par somme de contrôle dans %2$@ et ajoute ce répertoire au PATH de votre shell.
ja: CodeRouter CLI がインストールされていません。cmux は公式インストーラーを実行して今すぐインストールできます: %1$@ チェックサムを検証した CodeRouter バイナリを %2$@ にダウンロードし、そのディレクトリをシェルの PATH に追加します。
ko: CodeRouter CLI가 설치되어 있지 않습니다. cmux가 지금 공식 설치 프로그램을 실행하여 설치할 수 있습니다: %1$@ 이를 통해 체크섬이 확인된 CodeRouter 바이너리를 %2$@에 다운로드하고 해당 디렉토리를 쉘 PATH에 추가합니다.
zh_hans: 未安装 CodeRouter CLI。cmux 现在可以通过运行官方安装程序来进行安装： %1$@ 这将下载经过校验和验证的 CodeRouter 二进制文件到 %2$@，并将该目录添加到您的 shell PATH 中。
zh_hant: 未安裝 CodeRouter CLI。cmux 現在可以藉由執行官方安裝程式來安裝它： %1$@ 這會將經總和檢查碼 (checksum) 驗證的 CodeRouter 二進位檔下載到 %2$@，並將該目錄新增至您的 shell PATH。

# cli.coderouter.commands
source: coderouter <status|machines|claude> [--team <id>] [--json] (team model-plane settings; other verbs pass through)
ar: coderouter <status|machines|claude> [--team <id>] [--json] (إعدادات مستوى النماذج للفريق؛ تُمرَّر الأوامر الأخرى كما هي)
bs: coderouter <status|machines|claude> [--team <id>] [--json] (postavke modelne ravni tima; ostale komande se prosljeđuju)
da: coderouter <status|machines|claude> [--team <id>] [--json] (teamets modelplan-indstillinger; andre kommandoer sendes videre)
de: coderouter <status|machines|claude> [--team <id>] [--json] (Team-Einstellungen der Modellebene; andere Befehle werden durchgereicht)
es: coderouter <status|machines|claude> [--team <id>] [--json] (ajustes del plano de modelos del equipo; los demás verbos se pasan sin cambios)
fr: coderouter <status|machines|claude> [--team <id>] [--json] (réglages du plan de modèles de l'équipe ; les autres verbes sont transmis tels quels)
it: coderouter <status|machines|claude> [--team <id>] [--json] (impostazioni del piano modelli del team; gli altri comandi passano inalterati)
ja: coderouter <status|machines|claude> [--team <id>] [--json] (チームのモデルプレーン設定。その他のサブコマンドはそのまま渡されます)
ko: coderouter <status|machines|claude> [--team <id>] [--json] (팀 모델 플레인 설정; 다른 하위 명령은 그대로 전달됩니다)
nb: coderouter <status|machines|claude> [--team <id>] [--json] (teamets modellplan-innstillinger; andre kommandoer sendes videre)
pl: coderouter <status|machines|claude> [--team <id>] [--json] (ustawienia płaszczyzny modeli zespołu; pozostałe polecenia są przekazywane dalej)
pt_br: coderouter <status|machines|claude> [--team <id>] [--json] (configurações do plano de modelos da equipe; outros verbos são repassados)
ru: coderouter <status|machines|claude> [--team <id>] [--json] (настройки модельного плана команды; остальные команды передаются как есть)
th: coderouter <status|machines|claude> [--team <id>] [--json] (การตั้งค่า model plane ของทีม; คำสั่งอื่นส่งผ่านตามเดิม)
tr: coderouter <status|machines|claude> [--team <id>] [--json] (ekibin model düzlemi ayarları; diğer komutlar olduğu gibi iletilir)
uk: coderouter <status|machines|claude> [--team <id>] [--json] (налаштування модельного плану команди; інші команди передаються без змін)
zh_hans: coderouter <status|machines|claude> [--team <id>] [--json] (团队模型平面设置；其他子命令原样透传)
zh_hant: coderouter <status|machines|claude> [--team <id>] [--json] (團隊模型平面設定；其他子命令原樣透傳)

# cli.coderouter.error.launchFailed
source: Could not start the required CLI. Check the installation and try again.
ar: تعذر تشغيل أداة سطر الأوامر المطلوبة. تحقّق من التثبيت ثم أعد المحاولة.
bs: Traženi CLI nije moguće pokrenuti. Provjerite instalaciju i pokušajte ponovo.
da: Den nødvendige CLI kunne ikke startes. Kontrollér installationen, og prøv igen.
de: Die erforderliche CLI konnte nicht gestartet werden. Überprüfen Sie die Installation und versuchen Sie es erneut.
es: No se pudo iniciar la CLI necesaria. Comprueba la instalación y vuelve a intentarlo.
fr: Impossible de démarrer la CLI requise. Vérifiez l’installation, puis réessayez.
it: Impossibile avviare la CLI richiesta. Verifica l'installazione e riprova.
ja: 必要な CLI を起動できませんでした。インストールを確認して、もう一度お試しください。
ko: 필요한 CLI를 시작할 수 없습니다. 설치를 확인한 후 다시 시도하세요.
nb: Kunne ikke starte den nødvendige CLI-en. Kontroller installasjonen og prøv igjen.
pl: Nie można uruchomić wymaganej biblioteki CLI. Sprawdź instalację i spróbuj ponownie.
pt_br: Não foi possível iniciar a CLI necessária. Verifique a instalação e tente novamente.
ru: Не удалось запустить необходимый CLI. Проверьте установку и повторите попытку.
th: ไม่สามารถเริ่ม CLI ที่จำเป็นได้ โปรดตรวจสอบการติดตั้งแล้วลองอีกครั้ง
tr: Gerekli CLI başlatılamadı. Kurulumu kontrol edip tekrar deneyin.
uk: Не вдалося запустити потрібний CLI. Перевірте встановлення та повторіть спробу.
zh_hans: 无法启动所需的 CLI。请检查安装并重试。
zh_hant: 無法啟動必要的 CLI。請檢查安裝後再試一次。

# cli.codexTeams.watcher.subagent.depthExceeded
source: cmux codex-teams watcher skipped a Codex subagent: depth %1$lld exceeds the automatic pane limit %2$lld.
ar: تخطى مراقب cmux codex-teams وكيل Codex فرعي: يتجاوز العمق %1$lld حد الجزء التلقائي %2$lld.
de: cmux codex-teams-Watcher hat einen Codex-Subagenten übersprungen: Die Tiefe %1$lld überschreitet das automatische Teilfenster-Limit %2$lld.
es: El observador de cmux codex-teams omitió un subagente de Codex: la profundidad %1$lld supera el límite automático de paneles de %2$lld.
fr: L’observateur cmux codex-teams a ignoré un sous-agent Codex : la profondeur %1$lld dépasse la limite automatique de volets de %2$lld.
ja: cmux codex-teams ウォッチャーは Codex サブエージェントをスキップしました: 深さ %1$lld がペイン自動作成の上限 %2$lld を超えています。
ko: cmux codex-teams watcher가 Codex 서브에이전트(subagent)를 건너뛰었습니다: 깊이 %1$lld이(가) 자동 분할 창 제한인 %2$lld(을)를 초과합니다.
zh_hans: cmux codex-teams 监视器跳过了一个 Codex 子代理：深度 %1$lld 超过自动窗格上限 %2$lld。
zh_hant: cmux codex-teams watcher 跳過了一個 Codex 子代理：深度 %1$lld 超出自動窗格限制 %2$lld。
